airplane/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.215;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           uniform 1.215;
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.215;
        value           uniform 1.215;
    }

    airplane
    {
        type            kqRWallFunction;
        value           uniform 1.215;
    }

    lowerWall
    {
        type            slip;
    }
    
    upperWall
    {
        type            slip;
    }

    frontAndBack
    {
        type            slip;
    }
}


// ************************************************************************* //
