airplane/system/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

vorticity1
{
    type            vorticity;
    libs            ("libfieldFunctionObjects.so");
    writeControl    writeTime;
}

// ************************************************************************* //
